# coding: utf-8

import json
import sys

MORSE_CODE_DICT_EN = {
  'a': '.-', 'b': '-...', 'c':'-.-.', 'd':'-..', 'e':'.', 'f':'..-.', 
  'g':'--.', 'h':'....', 'i':'..', 'j':'.---', 'k':'-.-', 'l':'.-..',
  'm':'--', 'n':'-.', 'o':'---', 'p':'.--.', 'q':'--.-', 'r':'.-.', 
  's':'...', 't':'-', 'u':'..-', 'v':'...-', 'w':'.--', 'x':'-..-', 
  'y':'-.--', 'z':'--..', '1':'.----', '2':'..---', '3':'...--', 
  '4':'....-', '5':'.....', '6':'-....', '7':'--...', '8':'---..', 
  '9':'----.', '0':'-----', ', ':'--..--', '.':'.-.-.-', '?':'..--..', 
  '/':'-..-.', '-':'-....-', '(':'-.--.', ')':'-.--.-'
}

MORSE_CODE_DICT_JA = {
  'あ': '--.--', 'い': '.-', 'う': '..-', 'え': '-.---', 'お': '.-...',
  'か': '.-..', 'き': '-.-..', 'く': '...-', 'け': '-.--', 'こ': '----',
  'さ': '-.-.-', 'し': '--.-.', 'す': '---.-', 'せ': '.---.', 'そ':'---.',
  'た': '-.',	'ち': '..-.', 'つ': '.--.', 'て': '.-.--', 'と': '..-..',
  'な': '.-.', 'に': '-.-.', 'ぬ': '....', 'ね': '--.-', 'の': '..--',
  'は': '-...', 'ひ': '--..-', 'ふ': '--..', 'へ': '.', 'ほ': '-..',
  'ま': '-..-', 'み': '..-.-', 'む': '-', 'め': '-...-', 'も': '-..-.',
  'や': '.--', 'ゆ': '-..--', 'よ': '--',
  'ら': '...',  'り': '--.', 'る': '-.--.','れ': '---', 'ろ': '.-.-',
  'わ': '-.-', 'ゐ': '.-..-', 'ゑ': '.--..', 'を': '.---', 'ん': '.-.-.',
  '゛': '..', '゜': '..--.', '。': '.-.-..',  'ー': '.--.-', '、': '.-.-.-', 
  '（': '-.--.-',  '）': '.-..-.', 
  '1':'.----', '2':'..---', '3':'...--', '4':'....-', '5':'.....', 
  '6':'-....', '7':'--...', '8':'---..', '9':'----.', '0':'-----'
}

def decrypt(lang, input):
  if lang == 'ja':
    return _morse_to_letters(input, MORSE_CODE_DICT_JA)
  elif lang == 'en':
    return _morse_to_letters(input, MORSE_CODE_DICT_EN)
  else:
    return 'Invalid argument. Usage: <lang (`ja` or `en`)> <morse code (`.` or `-`, split by space)>)'
  

def _morse_to_letters(input, morse_dict):
  if not input:
    return 'No morse code input.'
  reversed_dict = {value:key for key,value in morse_dict.items()}
  result = ''
  for m in input:
    result += reversed_dict.get(m, '#')
  return result

if __name__ == '__main__':
  args = sys.argv[1].split()
  lang, input = args[0], args[1:]
  result = {
    'items': [{
      'uid': 'morse',
      'title': decrypt(lang, input),
      'arg': decrypt(lang, input)
    }]
  }
  sys.stdout.write(json.dumps(result, ensure_ascii=False))
